cron/payment/logs/20141013_031503_buckaroo-request.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://checkout.buckaroo.nl/PaymentEngine/2011/10/TransactionRequest/Request/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="https://checkout.buckaroo.nl/PaymentEngine/" xmlns:ns3="http://www.w3.org/2000/09/xmldsig#" xmlns:ns4="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><SOAP-ENV:Header><ns2:MessageControlBlock Id="_control"><ns2:WebsiteKey>JhNRiAjYJe</ns2:WebsiteKey><ns2:Culture>nl-NL</ns2:Culture><ns2:TimeStamp>2014-10-13T03:15:01+02:00</ns2:TimeStamp><ns2:Channel>Web</ns2:Channel></ns2:MessageControlBlock><ns4:Security><ns3:Signature><ns3:SignedInfo><ns3:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ns3:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ns3:Reference URI="#_body"><ns3:Transforms><ns3:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ns3:Transforms><ns3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ns3:DigestValue></ns3:DigestValue></ns3:Reference><ns3:Reference URI="#_control"><ns3:Transforms><ns3:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ns3:Transforms><ns3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ns3:DigestValue></ns3:DigestValue></ns3:Reference></ns3:SignedInfo><ns3:SignatureValue></ns3:SignatureValue></ns3:Signature></ns4:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:TransactionRequest><ns1:Currency>EUR</ns1:Currency><ns1:AmountDebit>34</ns1:AmountDebit><ns1:AmountCredit xsi:nil="true"/><ns1:Invoice>20141013000759</ns1:Invoice><ns1:Description>Peduli Anak recurring donation. Transaction 20141013000759</ns1:Description><ns1:ClientIP Type="IPv4">31.171.202.6</ns1:ClientIP><ns1:OriginalTransactionKey>7A3EE2EF82034D67AAAE4E744A57A721</ns1:OriginalTransactionKey><ns1:StartRecurrent>false</ns1:StartRecurrent><ns1:Services><ns1:Service Name="mastercard" Action="PayRecurrent" Version="1"/></ns1:Services></ns1:TransactionRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>


<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://checkout.buckaroo.nl/PaymentEngine/2011/10/TransactionRequest/Request/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="https://checkout.buckaroo.nl/PaymentEngine/" xmlns:ns3="http://www.w3.org/2000/09/xmldsig#" xmlns:ns4="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><SOAP-ENV:Header><ns2:MessageControlBlock Id="_control"><ns2:WebsiteKey>JhNRiAjYJe</ns2:WebsiteKey><ns2:Culture>nl-NL</ns2:Culture><ns2:TimeStamp>2014-10-13T03:15:01+02:00</ns2:TimeStamp><ns2:Channel>Web</ns2:Channel></ns2:MessageControlBlock><ns4:Security><ns3:Signature><ns3:SignedInfo><ns3:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ns3:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ns3:Reference URI="#_body"><ns3:Transforms><ns3:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ns3:Transforms><ns3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ns3:DigestValue></ns3:DigestValue></ns3:Reference><ns3:Reference URI="#_control"><ns3:Transforms><ns3:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ns3:Transforms><ns3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ns3:DigestValue></ns3:DigestValue></ns3:Reference></ns3:SignedInfo><ns3:SignatureValue></ns3:SignatureValue></ns3:Signature></ns4:Security><ns2:MessageControlBlock Id="_control"><ns2:WebsiteKey>JhNRiAjYJe</ns2:WebsiteKey><ns2:Culture>nl-NL</ns2:Culture><ns2:TimeStamp>2014-10-13T03:15:02+02:00</ns2:TimeStamp><ns2:Channel>Web</ns2:Channel></ns2:MessageControlBlock><ns4:Security><ns3:Signature><ns3:SignedInfo><ns3:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ns3:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ns3:Reference URI="#_body"><ns3:Transforms><ns3:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ns3:Transforms><ns3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ns3:DigestValue></ns3:DigestValue></ns3:Reference><ns3:Reference URI="#_control"><ns3:Transforms><ns3:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ns3:Transforms><ns3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ns3:DigestValue></ns3:DigestValue></ns3:Reference></ns3:SignedInfo><ns3:SignatureValue></ns3:SignatureValue></ns3:Signature></ns4:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:TransactionRequest><ns1:Currency>EUR</ns1:Currency><ns1:AmountDebit>48</ns1:AmountDebit><ns1:AmountCredit xsi:nil="true"/><ns1:Invoice>20141013000760</ns1:Invoice><ns1:Description>Peduli Anak recurring donation. Transaction 20141013000760</ns1:Description><ns1:ClientIP Type="IPv4">31.171.202.6</ns1:ClientIP><ns1:OriginalTransactionKey>D5DA83857BDD4FA7873C501CECED4BB4</ns1:OriginalTransactionKey><ns1:StartRecurrent>false</ns1:StartRecurrent><ns1:Services><ns1:Service Name="visa" Action="PayRecurrent" Version="1"/></ns1:Services></ns1:TransactionRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>


